<a href="https://colab.research.google.com/github/Jrfornari18/DataScienceClass/blob/master/FinalJob_CreditDB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
# Importação das Bibliotecas

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

# Leitura do Dataset Original

credit=pd.read_csv('dados/credit.csv')
#credit=credit.drop('clientid',axis=1)
credit=credit.set_index('clientid')

In [10]:
credit.columns.tolist()
#[clientid	income	age	loan	default]

['income', 'age', 'loan', 'default']

In [13]:
credit.head(1000)

                income        age         loan  default
clientid
1         66155.925095  59.017015  8106.532131        0
2         34415.153966  48.117153  6564.745018        0
3         57317.170063  63.108049  8020.953296        0
4         42709.534201  45.751972  6103.642260        0
5         66952.688845  18.584336  8770.099235        1
...                ...        ...          ...      ...
996       21593.622658  51.548923   458.093724        0
997       49104.768240  35.538517  9452.217947        0
998       65776.232413  39.798191  2805.863745        0
999       36192.149452  21.402403  7236.173930        1
1000      62165.861186  19.602543  4739.948954        0

[1000 rows x 4 columns]

In [14]:
credit.corr()

           income       age      loan   default
income   1.000000 -0.033687  0.441117  0.002284
age     -0.033687  1.000000  0.002309 -0.429759
loan     0.441117  0.002309  1.000000  0.377160
default  0.002284 -0.429759  0.377160  1.000000